Revit 2024 API
BuiltInFailures.MEPCalculationFailures.SeparationWithOddJunction Property
 Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SeparationWithOddJunction { get; }
Visual Basic
Public Shared ReadOnly Property SeparationWithOddJunction As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SeparationWithOddJunction {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace